#!/usr/bin/env python3.10
# -*- coding: utf-8 -*-
# Набор вопросов по 4 предметам, каждый по одиночной шкале
# 4 предмета в сумме дадут множественную шкалу

questions = {
    "geography": [
        {
            "q": "Самый большое островное государство?",
            "a": {
                "Индонезия": 1010,
                "Дания": 120,
                "Мадагаскар": 730,
                "Япония": 340,
            },
            "penalty": 11,
        },
        {
            "q": "Вторая по высоте гора на Земле?",
            "a": {
                "Джомолунгма": 110,
                "Чогори": 1020,
                "Лхоцзе": 430,
                "Канченджанга": 240,
            },
            "penalty": 12,
        },
        {
            "q": "Год открытия Антарктиды российской экспедицией?",
            "a": {
                "1798": 310,
                "1820": 820,
                "1857": 130,
                "1844": 540,
            },
            "penalty": 13,
        },
        {
            "q": "Чего больше: параллелей или меридианов?",
            "a": {
                "Их бесконечно": 651,
                "Поровну": 332,
                "Параллелей": 103,
                "Меридианов": 104,
            },
            "penalty": 14,
        },
        {
            "q": "Столица Колумбии?",
            "a": {
                "Коломбо": 101,
                "Кито": 82,
                "Богота": 823,
                "Медельин": 314,
            },
            "penalty": 15,
        },
        {
            "q": "На гербе какого российского города есть дракон?",
            "a": {
                "Казань": 941,
                "Рязань": 302,
                "Сургут": 273,
                "Петергоф": 104,
            },
            "penalty": 16,
        },
        {
            "q": "Какой город старше?",
            "a": {
                "Мельбурн": 111,
                "Вашингтон": 22,
                "Париж": 613,
                "Ереван": 899,
            },
            "penalty": 17,
        },
        {
            "q": "Самая длинная река Северной Америки?",
            "a": {
                "Миссисипи": 771,
                "Миссиписи": 22,
                "Миссури": 663,
                "Миссуриси": 44,
            },
            "penalty": 18,
        },
        {
            "q": "Что из этого не портовый город?",
            "a": {
                "Барселона": 11,
                "Аделаида": 22,
                "Шанхай": 33,
                "Сулавеси": 754,
            },
            "penalty": 19,
        },
        {
            "q": "Кто их них не сделал кругосветку?",  #
            "a": {
                "Конюхов": 31,
                "Магеллан": 820,
                "Беллинсгаузен ": 133,
                "Кук": 240,
            },
            "penalty": 20,
        },
    ],

    "astronomy": [
        {
            "q": "Сколько планет в Солнечной системе?",
            "a": {
                "8": 721,
                "9": 332,
                "10": 243,
            },
            "penalty": 21,
        },
        {
            "q": "Сколько естественных спутников у Марса?",
            "a": {
                "0": 111,
                "4": 222,
                "2": 733,
                "3": 244,
            },
            "penalty": 22,
        },
        {
            "q": "Какого созведия нет?",
            "a": {
                "Заяц": 251,
                "Лиса": 901,
                "Волк": 363,
                "Индеец": 104,
            },
            "penalty": 23,
        },
        {
            "q": "Космический корабль Юрия Гагарина?",
            "a": {
                "Восток": 801,
                "Восход": 302,
                "Пароход": 53,
                "Приход": 4,
            },
            "penalty": 24,
        },
        {
            "q": "Что из этого самое большое расстояние?",
            "a": {
                "6000 а.е.": 901,  # 9 * 10**11
                "Световой месяц": 222,  # 7.9 * 10**11
                "20 миллипарсек": 333,  # 6,2 * 10**11
            },
            "penalty": 24,
        },
        {
            "q": "Самый большой кратер на видимой стороне Луне?",
            "a": {
                "Тихо": 611,
                "Коперник": 222,
                "Рейта": 203,
                "Байи": 944,
            },
            "penalty": 25,
        },
        {
            "q": "Самая яркая для нас звезда после Солнца?",
            "a": {
                "Венера": 111,
                "Сириус А": 752,
                "Бетельгейзе": 303,
                "Вега": 224,
            },
            "penalty": 26,
        },
        {
            "q": "Космонавт по-китайски?",
            "a": {
                "Космонавт": 301,
                "Тайконавт": 612,
                "Тайкунавт": 612,
                "Астронавт": 74,
            },
            "penalty": 27,
        },
        {
            "q": "Год запуска первого ИСЗ?",
            "a": {
                "1957": 791,
                "1945": 302,
                "1961": 213,
                "1959": 504,
            },
            "penalty": 28,
        },
        {
            "q": "Пояс Койпера или пояс астероидов ближе к Солнцу?",
            "a": {
                "Пояс Койпера": 1,
                "Пояс астероидов": 102,
            },
            "penalty": 29,
        },
    ],

    "literature": [
        {
            "q": "Год рождения Пушкина?",
            "a": {
                "1799": 710,
                "1899": 120,
                "1800": 330,
                "1801": 240,
            },
            "penalty": 31,
        },
        {
            "q": "Кто написал балладу 'Вересковый мёд'?",
            "a": {
                "Вальтер Скотт": 110,
                "Роберт Бернс": 220,
                "Юрий Лужков": 30,
                "Роберт Стивенсон": 1040,
            },
            "penalty": 32,
        },
        {
            "q": "Что из этого написал Максим Горький?",
            "a": {
                "Мать": 510,
                "Отец": 220,
                "Тесть": 130,
                "Шурин": 40,
            },
            "penalty": 33,
        },
        {
            "q": "Месяц, выдуманный Н.В. Гоголем?",
            "a": {
                "Мартобрь": 881,
                "Студень": 222,
                "Сплюнь": 133,
                "Маюнь": 244,
            },
            "penalty": 34,
        },
        {
            "q": "Автор строк про плечистого и крепкого парня со значком ГТО?",
            "a": {
                "Маршак": 911,
                "Михалков": 122,
                "Маяковский": 213,
                "Чуковский": 144,
            },
            "penalty": 35,
        },
        {
            "q": "Кто НЕ из свиты Воланда?",
            "a": {
                "Азазелло": 51,
                "Коровьев": 202,
                "Белла": 873,
                "Кот Бегемот": 41,
            },
            "penalty": 36,
        },
        {
            "q": "Кто победил дон Кихота в последнем сражении?",
            "a": {
                "Карраско": 1111,
                "Веласкес": 222,
                "Коррадо": 333,
                "Водевилья": 104,
            },
            "penalty": 37,
        },
        {
            "q": "Автор книг про Гарри Поттера?",
            "a": {
                "Ромулинг": 91,
                "Роуллинг": 402,
                "Роулинг": 653,
                "Роулинк": 134,
            },
            "penalty": 38,
        },
        {
            "q": "Кто является автором романа 'По ком звонит колокол'?",
            "a": {
                "Хемингуэй": 911,
                "Шекли": 222,
                "Паланик": 303,
                "Стейнбек": 164,
            },
            "penalty": 39,
        },
        {
            "q": "Сколько строк в классическом сонете Шекспира?",
            "a": {
                "Более 100": 71,
                "14": 999,
                "36": 333,
                "32": 244,
            },
            "penalty": 40,
        },
    ],

    "math": [
        {
            "q": "Чему равно 10!?",
            "a": {
                "10": 210,
                "10000000000": 520,
                "3628800": 1030,
                "10?!": 140,
            },
            "penalty": 41,
        },
        {
            "q": "Что больше: e^pi или pi^e?",
            "a": {
                "e^pi больше": 1010,
                "Бред": 120,
                "Равны": 230,
                "pi^e больше": 340,
            },
            "penalty": 42,
        },
        {
            "q": "Первые два числа Фибоначчи: F0 = 0, F1 = 1. "
                 "Назови десятое число Фибоначчи F10?",
            "a": {
                "60": 210,
                "55": 720,
                "10": 130,
                "89": 540,
            },
            "penalty": 43,
        },
        {
            "q": "100 * 100?",
            "a": {
                "Гугол": 21,
                "1000": 309,
                "10000": 602,
                "100000": 208,
            },
            "penalty": 44,
        },
        {
            "q": "Что больше: 9/30 или 18/60",
            "a": {
                "Бред": 10,
                "Равны": 520,
                "9/30 больше": 50,
                "18/60 больше": 60,
            },
            "penalty": 45,
        },
        {
            "q": "3.(3) = 9?",
            "a": {
                "Да": 310,
                "Нет": 420,
                "Не знаю": 12,
            },
            "penalty": 46,
        },
        {
            "q": "1/2 + 1/4 + 1/8 + ... = ?",
            "a": {
                "0": 11,
                "1": 902,
                "2": 103,
                "Бесконечность": 204,
            },
            "penalty": 47,
        },
        {
            "q": "Объём окружности радиусом r=5?",
            "a": {
                "0": 911,
                "pi*r*r": 122,
                "4/3 * pi * r**3": 221,
            },
            "penalty": 48,
        },
        {
            "q": "Площадь прямоугольника 6х8?",
            "a": {
                "48": 555,
                "-48": 10,
                "68": 102,
                "84": 201,
            },
            "penalty": 49,
        },
        {
            "q": "Сколько граней у куба?",
            "a": {
                "6": 777,
                "4": 111,
                "8": 105,
                "12": 209,
            },
            "penalty": 49,
        },
    ],
}
